import datetime

def printTimeStamp(name):
    print("Автор програми: " + name)
    print("Час компіляції: " + str(datetime.datetime.now()),"\n")
printTimeStamp("Valeriy Neroznak")

f=["Будинок","Квартира","Гуртожиток"]
print ("Можливий вибір місце проживання :",f)
a=input("Місце проживання:")
b=int(input("Час вдома:"))

if a=="Будинок" and b>=18:
    print("Рекомендована домашня тварина: В’єтнамське порося")
elif a == "Будинок" and 10< b <17 :
    print("Рекомендована домашня тварина: Собака")
elif a == "Будинок" and b <10:
    print("Рекомендована домашня тварина: Змія")
elif a == "Квартира" and b >10 :
    print("Рекомендована домашня тварина: Кішка")
elif a == "Квартира" and b <10 :
    print("Рекомендована домашня тварина: Хом’як")
elif a == "Гуртожиток" and b >6:
    print("Рекомендована домашня тварина: Рибки")
elif a == "Гуртожиток" and b < 6:
    print("Рекомендована домашня тварина: Мурашник")
else:
    print("Введені не правильні дані")

